[
    {
      "id": "624a4d781f1bc8a5a593c919",
      "name": "Corine Navarro",
      "description": "Hands down the best Mac thus far! Apple says that every keynote, but fortunately for us, it also happens to be true! The construction, design and performance are unmatched! Even the bottom of the barrel 16” will wipe the floor with my fully spec’s previous 16” Intel powered MBP. Kudos Apple, you did it again! Now just make it cost 50% cheaper and you will be unstoppable!",
      "rating": "5"
    },
    {
      "id": "624a4d78d20fa8f3169910f3",
      "name": "Barlow Aguirre",
      "description": "Value every cent. Just recommended. I tried another one before and came back to get it. Don’t waste your time and money. Get it.",
      "rating": "5"
    },
    {
      "id": "624a4d781ee53a3f7be5939b",
      "name": "Ayers Wilder",
      "description": "This macbook in 2021 is a game changer!! Being a multimedia creative, this MacBook provides the power & features for being able to edit right on the go!",
      "rating": "5"
    },
    {
      "id": "624a4d7837b5f6f154668f5f",
      "name": "Buck Mcdonald",
      "description": "outstanding MacBook Pro!!! I love it! Xtreamly useful for my graphic design business",
      "rating": "5"
    },
    {
      "id": "624a4d78d9b697075064cb77",
      "name": "Morse Everett",
      "description": "Love my new Mac Pro! It’s fast and very helpful for prepping my work. The only thing I don’t like is the lack of USB pets and having to use a USB-C. My older model had plenty of USB ports and made it easier to switch between CD and flash drives quicker and easier than having to always make sure I have adapter close by.",
      "rating": "4"
    },
    {
      "id": "624a4d7821e9476a3bf2bd93",
      "name": "Fitzpatrick Carney",
      "description": "I have had the MacBook Pro 16 for a month now. It took a little getting used to as this is my first time with an Apple computer but it is a great computer. The battery life has been great, it has not gotten hot even when running final cut pro. I would recommend you look into this computer.",
      "rating": "5"
    }
  ]