import React from 'react';
import './Blog.css';

const Blog = () => {
    return (
        <div className='blog-container'>
            <h2>১. What is context API?</h2>
            <p>
                রিঅ্যাক্ট এর কনটেক্সট এপিআই হল একটি উপায় যার মাধ্যমে কার্যকর ভাবে রিঅ্যাক্ট অ্যাপের গ্লোবাল ভেরিয়েবল তৈরি করে এক কম্পোনেন্ট এর ডাটা অন্য কম্পোনেন্ট এ খুব সহজেই পাঠানো যায়। এটি মুলত প্রপ ড্রিলিং এর বিকল্প হিসেবে ব্যাবহার করা হয়। প্রপস এর মাধ্যমে যেমন দাদা-দাদি থেকে শিশু এবং তার থেকে পিতা-মাতাকে ডাটা পাঠানো যায়। তেমনি কনটেক্সট এপিআই দিয়েও প্রপস এর কাজ খুব সহজেই করে ফেলা যায়। আরও সহজ ভাবে বলা জেতে পারে, কনটেক্সট এপিআই দিয়ে গাছের প্রতিটি স্তরের মধ্যে প্রপস না পাঠিয়ে কম্পোনেন্ট জাতিয় মান পাঠানো হয় এবং এদের মধ্যে যোগসূত্র স্থাপন করা হয়। 
            </p>
            <br />
            <br />

            <h2>২. Inline, block এবং inline-block elements গুলোর মধ্যে পার্থক্য কি?</h2>

            <p>
                ইনলাইন, ব্লক এবং ইনলাইন-ব্লক এই তিন্ টি মুলত সিএসএস এর উপাদান। ইনলাইন উপাদান কোন নতুন লাইন এ শুরু হয় না এবং এটি শুধু মাত্র তার বরাদ্দিত প্রস্থটি দখল করে। পক্ষান্তরে ব্লক উপাদান শুরু হয় নতুন লাইন দিয়ে এবং এটি পুরো প্রস্থটি দখল করে। ইনলাইন উপাদান এর প্রস্থ বা উচ্চতা নিজের মত করে সেট করা যায় না, কিন্তু ব্লক উপাদান এর প্রস্থ বা উচ্চতার মান প্রয়োজন অনুযায়ী সেট করা যায়। আর ইনলাইন-ব্লক এটি ইনলাইন উপাদান এর মত নতুন লাইন এ শুরু হয় না, তবে ব্লক উপাদান এর মত প্রস্থ এবং উচ্চতার মান সেট করা যায়।
            </p>
        </div>
    );
};

export default Blog;